TesboCFD/tutorials/verificationAndValidation/turbulenceModels/planeChannel/setups.orig/common/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

nx                  10;
ny                  100;
nz                  1;
xMin                0;
xMax                1;
yMin                0;
yMax                1;
yyMax               2;
zMin                0;
zMax                1;
yExpansion          10.09757454;
yExpansion2         #eval{ -1*$yExpansion };

vertices
(
    ($xMin  $yMin   $zMin)
    ($xMax  $yMin   $zMin)
    ($xMax  $yMax   $zMin)
    ($xMax  $yyMax  $zMin)
    ($xMin  $yyMax  $zMin)
    ($xMin  $yMax   $zMin)

    ($xMin  $yMin   $zMax)
    ($xMax  $yMin   $zMax)
    ($xMax  $yMax   $zMax)
    ($xMax  $yyMax  $zMax)
    ($xMin  $yyMax  $zMax)
    ($xMin  $yMax   $zMax)
);

blocks
(
    hex ( 0  1  2  5  6  7  8 11) ($nx $ny $nz) simpleGrading (1 $yExpansion 1)
    hex ( 5  2  3  4 11  8  9 10) ($nx $ny $nz) simpleGrading (1 $yExpansion2 1)
);

boundary
(
    bottom
    {
        type            wall;
        faces           ((0 6 7 1));
    }

    top
    {
        type            wall;
        faces           ((4 3 9 10));
    }

    leftAndRight
    {
        type            empty;
        faces
        (
            (1 2 5 0)
            (2 3 4 5)
            (6 11 8 7)
            (11 10 9 8)
        );
    }

    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 5 11 6)(5 4 10 11));
    }

    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 7 8 2)(2 8 9 3));
    }
);


// ************************************************************************* //
